{"inkVersion":21,"root":[["#","^title: The Coiled Crown","/#","#","^author: A gamebook by Sersa Victory","/#","#","^toolbar: player_toolbar","/#","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","\n","#","^IMAGE: images/intro.jpg","/#","^When the Carnophage came, not even the great queen’s invulnerable armored legions could turn back the scourge. Priestess and pauper, metalsmith and maiden — all fell ill to the plague that swept the halls of the Scorched Keep. Helpless to protect her people, the queen wept tears of charcoal.","\n","^Now only a world in ashes remains. Cold forests, towering ruins, abandoned shrines, and darkened stained glass windows stand as a silent memorial to a realm once lit by the queen’s holy bonfires.","\n","^Though brigands have picked clean the occult reliquaries of the queen and her sacred sisterhood, one elusive relic remains: the mythic Coiled Crown once worn by the queen herself. Claim the crown, adventurer, and with it a power beyond human imagination.","\n","ev","str","^Your adventure begins...","/str","/ev",{"*":"0.c-0","flg":4},{"c-0":["^ ",{"->":"start"},"\n",{"->":"0.g-0"},null],"g-0":["done",null]}],"done",{"start":[["#","^CLEAR","/#","^You think you’ve finally found it.","\n","^For days you’ve explored this maze-like ruined city, climbing over toppled towers and crumbled monuments beneath a cold overcast sky that echoed with the shrieking of distant wyverns.","\n","^After wedging open an unassuming steel door with your sword, you climbed a spiraling flight of broken stone steps until reaching a crypt dimly lit by shafts of gray daylight.","\n","ev","str","^Look around","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["#","^IMAGE: images/sarchophagus.jpg","/#","^You step into the shafts of overcast daylight and look down upon the sarcophagus. Its' cover stone bears the likeness of a regal hooded woman, her outline traced in brass.","\n","^The phrase “[red]<i>holy are those sisters who rise to lead</i>[/red]” is etched above her head. This must be where the ancient queen is buried — and with her, the Coiled Crown you so desperately seek.","\n","ev","str","^Open the sarcophagus","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":".^.^.^.g-1"},null]}],"g-1":["^The cover stone looks heavy, but feeling with gloved fingers along the edge, you find a seam into which you can slide your sword.","\n","^With a shout that echoes up into the high domed ceiling of this tower crypt, you push down on your blade like a lever and pry open the cover stone. The massive cover stone falls to the floor behind the sarcophagus, the thunderous sound frightening away unseen murders of crows perching outside the windows.","\n","ev","str","^Look inside","/str","/ev",{"*":".^.c-2","flg":4},{"c-2":["\n",{"->":".^.^.^.g-2"},null]}],"g-2":["^When the dust settles and the stench of ancient rotting cloth disperses, you gaze into the open crypt and see ... nothing.","\n","^This might be a trap.","\n","ev","str","^Step away","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Wait","/str","/ev",{"*":".^.c-4","flg":4},{"c-3":["\n","^Suspecting a trap, you pull your sword to your side and spring backward in one smooth practiced motion.","\n",{"->":".^.^.^.g-3"},null],"c-4":["\n","^You wait to see if anything happens.","\n",{"->":".^.^.^.g-3"},null]}],"g-3":["^Sure enough, a cloud of embers begins to billow out of the open sarcophagus and coalesce into the vague shape of a hooded woman. You try to raise your sword in defense and turn to flee, but some occult force holds you still.","\n","^Eyes wide, you watch the wraith-like cloud surround you, distant whispers filling your ears, your vision of the tower fading into a foggy white.","\n","ev","str","^Shut your eyes","/str","/ev",{"*":".^.c-5","flg":4},{"c-5":["\n",{"->":".^.^.^.g-4"},null]}],"g-4":["^You shut your eyes, hoping to blot out whatever netherworld magic has gripped you.","\n","^For a moment, you feel weightless. Then, there is silence, and you feel the crunch of solid ground beneath your boots.","\n","ev","str","^Open your eyes","/str","/ev",{"*":".^.c-6","flg":4},{"c-6":["^ ",{"->":"location_netherworld_forest"},"\n",null]}]}],null],"endgame":[["ev","str","^Respawn","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Start your journey again","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","#","^RESTART_FROM_CHECKPOINT","/#",{"->":".^.^.g-0"},null],"c-1":["\n","#","^RESTART","/#",{"->":".^.^.g-0"},null],"g-0":["end",null]}],null],"player_toolbar":["^[button onclick=player_inventory bordered=false][img]images/inventory.png[/img][/button]","\n",null],"player_inventory":["^[title]Inventory[/title]","\n","^You are carrying:","\n","^<ul>","<>","\n","ev",{"VAR?":"BMP"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Burnt map</li>",{"->":".^.^.^.11"},null]}],"nop","<>","\n","ev",{"VAR?":"FLB"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Bouquet of dead flower stems bound in black ribbon</li>",{"->":".^.^.^.18"},null]}],"nop","<>","\n","ev",{"VAR?":"FLW"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Bouquet of dead flower stems bound in white ribbon</li>",{"->":".^.^.^.25"},null]}],"nop","<>","\n","ev",{"VAR?":"BMK"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Brass burial mask</li>",{"->":".^.^.^.32"},null]}],"nop","<>","\n","ev",{"VAR?":"EPV"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Empty potion vial</li>",{"->":".^.^.^.39"},null]}],"nop","<>","\n","ev",{"VAR?":"EBC"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Everburning coal</li>",{"->":".^.^.^.46"},null]}],"nop","<>","\n","ev",{"VAR?":"PTN"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Healing potion</li>",{"->":".^.^.^.53"},null]}],"nop","<>","\n","ev",{"VAR?":"HMD"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Hymn of mending</li>",{"->":".^.^.^.60"},null]}],"nop","<>","\n","^<li>Longsword</li>","<>","\n","ev",{"VAR?":"WFG"},"/ev",[{"->":".^.b","c":true},{"b":["^<li>Wax figurine</li>",{"->":".^.^.^.70"},null]}],"nop","<>","\n","^</ul>","\n",["ev",{"VAR?":"BFR"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You have the <b>blessing of fire</b>.","\n",{"->":".^.^.^.77"},null]}],["ev",{"VAR?":"BIR"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You have the <b>blessing of iron</b>.","\n",{"->":".^.^.^.77"},null]}],"nop","\n","ev",{"VAR?":"RVK"},"/ev",[{"->":".^.b","c":true},{"b":["^ You have the <b>revelation of Kaldera</b>.",{"->":".^.^.^.83"},null]}],"nop","\n",null],"location_netherworld_forest":[["#","^CHECKPOINT","/#","#","^AUDIOLOOP: music/forest.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/netherworld-forest-64.jpg","/#","^<h3>Netherworld Forest</h3>","\n","^Gone is the ruined city with its fallen slabs of stone and screeching crows picking at vermin in the briars.","\n","^Instead, you stand surrounded by an endless forest of thin bare trees jutting up from the dirt like bleached bones. Fog hangs heavy in all directions. Sticking your hand out in front of you, you feel as if you could grab the thick mist out of the air.","\n","^A path of well-trodden dirt winds into the distance.","\n",["ev","str","^Check your equipment","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Follow the path through the fog","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You are carrying a longsword and an [red]empty potion vial[/red] that was once filled with healing liquid.","\n","^Your cloak and leather armor are a little worse for wear, but you are otherwise unharmed.","\n",{"->":".^.^"},{"->":".^.^.^.g-0"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.g-0"},null],"#n":"opts1"}],{"g-0":["^The narrow dirt path winds between the trees. You see no buildings through the thick fog ahead of or behind you.","\n","^Pausing to take in your surroundings in search of any sign of a clearing, you spy at the edge of your vision a hooded ghostly figure drifting between the bare trees. Then another. And then still another, all identical to the apparition that snatched you from the tower crypt and brought you to this place.","\n","^In total, you spot more than two dozen ghosts amid the trees. None notice you, and none cross the walking path. For now.","\n","ev",{"VAR?":"WFG"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ A wax figurine rests against a cairn at your feet.",{"->":".^.^.^.11"},null]}],"nop","\n",["ev","str","^Take wax figurine","/str",{"VAR?":"WFG"},"!","/ev",{"*":".^.c-2","flg":21},"ev","str","^Continue on the path through the fog","/str",{"VAR?":"WFG"},"/ev",{"*":".^.c-3","flg":5},{"c-2":["\n","^You pick up the wax figurine and inspect it. It’s carved in the likeness of a phoenix. Holding it close to your face, it smells faintly of soap.","\n","^>>+ You now have the <b>wax figurine</b>.","\n","ev",true,"/ev",{"VAR=":"WFG","re":true},{"->":".^.^"},{"->":".^.^.^.^.g-1"},{"#f":5}],"c-3":["\n",{"->":".^.^.^.^.g-1"},null],"#n":"opts2"}],null],"g-1":["#","^IMAGE: images/forest-20.jpg","/#","^After wandering along the narrow dirt path for what feels like hours, the skeletal trees finally give way to a cliff face overlooking an evergreen forest draped in fog. The entire forest is eerie in its silence — not a single crunch of a branch, chirp of a bird, or whistle of air through leaves and needles.","\n","ev","str","^Peer over the cliff face","/str","/ev",{"*":".^.c-4","flg":4},{"c-4":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}]}],null],"location_forest_cliff_face":[["#","^AUDIOLOOP: music/forest.mp3","/#","#","^CLEAR","/#","ev",{"CNT?":".^.^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ You stand atop a cliff face overlooking a silent forest of evergreen trees draped in thick fog. The overcast sky shifts to a dull purple as whatever sun lights this world descends beneath some distant unseen mountain range.",{"->":".^.^.^.12"},null]}],"nop","\n","^Peering over the cliff face, you see handholds carved into the rock, allowing you to climb down in relative safety should you so choose.","\n","^The dirt path turns to the left and follows the cliff edge toward a hazy spot of lantern light in the distance.","\n","ev","str","^Follow the path toward the lantern light","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Climb down the cliff face","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"lantern_path"},"\n",null],"c-1":["^ ",{"->":"cliff_down"},"\n",null]}],{"#f":1}],"lantern_path":[["^The narrow dirt path winds along the edge of the cliff face. Drawing nearer to the lantern light in the distance, you hear a sound that breaks the otherwise oppressive silence of the forest — the trickling of water.","\n","ev","str","^Move on","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["^You pass through a break in the fog to see thin sheets of water pouring down the side of a root-choked cliff face. An opening in the cliff, draped in shadows, is visible behind the waterfall.","\n","^Peering up toward the deepening violet sky, you see handholds carved into the rock. They ascend toward a crumbling stone structure nestled among the misty trees atop the cliff. A dim lantern burns on a ruined wall up above.","\n","ev","str","^Climb up toward the stone structure","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Squeeze through the cave opening","/str","/ev",{"*":".^.c-2","flg":4},{"c-1":["^ ",{"->":"location_handmaidens_shrine"},"\n",null],"c-2":["^ ",{"->":"location_mossy_cave"},"\n",null]}]}],null],"cliff_down":[["#","^IMAGE: images/cliff-85.jpg","/#","^You climb down the side of the cliff, dirt and oily slime collecting underneath your fingernails. The evergreen trees now loom over you, silent.","\n","^Another narrow dirt path leads into the fog ahead of you, this time splitting into a number of forks that stretch off in all directions. It looks easy to get [red]lost[/red] down here.","\n","ev","str","^Continue into the evergreen forest","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Follow the markings on a burnt map","/str",{"VAR?":"BMP"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Climb back up the cliff face","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"death_lost_in_the_woods"},"\n",null],"c-1":["^ ",{"->":"follow_burnt_map"},"\n",null],"c-2":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}],null],"death_lost_in_the_woods":[["^You wander through the fog-draped forest and quickly become lost. As the sun sets and darkness creeps over this silent netherworld, the cold pierces you to the bone and becomes unbearable.","\n","ev","str","^Pull your cloak tight","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["#","^AUDIOLOOP: music/death.mp3","/#","^You pull your hooded cloak tight and curl up against a fallen tree trunk, teeth chattering. With no moon, you cannot even see the clouds of your last breaths or the reddening of your frostbitten skin before you drift into a numb sleep.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}],null],"follow_burnt_map":[["^You follow the markings on the soot-covered map, the lines of faded ink leading you through a twisting maze of overgrown dirt paths.","\n","^The paths converge at a towering domed structure erected into the side of a steep cliff face. The roof of the building rises out of sight above the canopy of branches overhead. Dirty stained glass windows ring the structure, their darkened frames thick with cobwebs.","\n","^Many of the windows are broken, fallen shards of glass in cold colors stuck upright in the ground at the base of the structure like rigid flowers.","\n","ev","str","^Enter the domed structure","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go back to the cliff face","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"location_holy_gatehouse"},"\n",null],"c-1":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}],null],"location_handmaidens_shrine":[["#","^CHECKPOINT","/#","#","^AUDIOLOOP: music/shrine.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/handmaidens-shrine-36.jpg","/#","^<h3>Handmaiden's Shrine</h3>","\n","^Torrents of water issue from the mouths of ornate figures carved into the root-covered walls of this crumbling shrine.","\n","^Alcoves in the stone walls, once overflowing with offerings to some unknown goddess, now sit empty, their contents long since plundered by others who journeyed this way in search of the Coiled Crown.","\n","^A large bell hangs from a rusted post nearby, the light of a lantern reflected in its intricately carved surface.","\n","^Part of the floor has collapsed, leaving a wide hole down into a mossy cave beneath your feet.","\n","ev","str","^Approach the bell","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Jump down into the mossy cave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"shrine_bell"},"\n",null],"c-1":["^ ",{"->":"location_mossy_cave"},"\n",null]}],null],"shrine_bell":[["#","^IMAGE: images/bell-82.jpg","/#","^Occult symbols and an inscription carefully etched in tiny letters cover the surface of this large bell.","\n","^Patches of rust and discoloration streak across the bell, as if it had hung here exposed to the elements for a thousand years.","\n",["ev","str","^Read the inscription on the bell","/str",{"^->":"shrine_bell.0.inscription_bell"},"turns",0,"!=","/ev",{"*":".^.c-0","flg":5},"ev","str","^Ring the bell","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Leave the bell alone and exit the shrine","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":".^.^.^.inscription_bell"},"\n",{"->":".^.^.^.inscription_bell"},null],"c-1":["^ ",{"->":".^.^.^.inscription_bell.ring_bell"},"\n",{"->":".^.^.^.inscription_bell"},{"#f":5}],"c-2":["^ ",{"->":"location_cave_exit"},"\n",{"->":".^.^.^.inscription_bell"},null],"#n":"opts"}],{"inscription_bell":["^The inscription in tiny letters reads:","\n","^“When the first handmaiden [red]Iryea[/red] fell ill to the Carnophage and her song no longer resounded through the halls of our Keep, our queen forged this great bell in her memory so that her song would ring eternal. This memorial bell is to be hung in the serene forest outside the Keep where the maiden so loved to wander. The mournful procession shall leave fragrant [red]lilacs[/red] along the wooded path, as such flowers brightened our beloved handmaid’s last days.”","\n",{"->":".^.^.opts"},["^The tolling of the bell resounds through the silent forest below, the sound rattling across needle-like branches and echoing through ruined shrines long since abandoned by those who once dwelled in this world. The branches beneath your feet twist and writhe like snakes before shaping themselves into the likeness of a horned woman. She speaks with a voice like wind rustling through the falling leaves of autumn.","\n","ev","str","^Listen","/str","/ev",{"*":".^.c-3","flg":4},{"c-3":["\n",{"->":".^.^.^.^.g-0"},null],"#n":"ring_bell"}],{"#f":6}],"g-0":["^“From her throne atop the Scorched Keep, the great queen [red]Kaldera[/red] once ruled over this land full of color and song, her divine bonfires driving away the nether spirits that now blanket our world in shadows and silence. Altars to the high goddess [red]Euryale[/red], who watched over the people of this land, crumble as the ages pass and the crown goes unworn.”","\n","ev","str","^Continue listening","/str","/ev",{"*":".^.c-4","flg":4},{"c-4":["\n",{"->":".^.^.^.g-1"},null]}],"g-1":["^“To have rung this blessed bell is to declare to this world that you seek the Coiled Crown once worn by our queen — I am bound to offer you one of her blessings so that you might face the malice that haunts her ruined stronghold.”","\n","ev","str","^Continue listening","/str","/ev",{"*":".^.c-5","flg":4},{"c-5":["\n",{"->":".^.^.^.g-2"},null]}],"g-2":["^“You may choose to accept her blessing of fire. Fire [red]drives away what stalks in the dark[/red], but may also make ashes of what you treasure most.”","\n","^“Or, you may choose to accept her blessing of iron. Iron [red]turns away the piercing spear[/red], but may also weigh you down when you must tread lightly.”","\n","ev","str","^Accept the blessing of fire","/str","/ev",{"*":".^.c-6","flg":4},"ev","str","^Accept the blessing of iron","/str","/ev",{"*":".^.c-7","flg":4},{"c-6":["^ ",{"->":".^.^.^.blessing_of_fire"},"\n",{"->":".^.^.^.blessing_of_fire"},null],"c-7":["^ ",{"->":".^.^.^.blessing_of_fire.blessing_of_iron"},"\n",{"->":".^.^.^.blessing_of_fire"},null]}],"blessing_of_fire":["^You feel a warmth spread through your body. Your eyes crackle like the flames of a campfire and your fingertips glow a dull red.","\n","^“Seek the Scorched Keep,” the dryad whispers. “The Coiled Crown awaits you there.”","\n","^The bell tolls one final time, and the dryad melts back into the tangle of branches beneath your boots.","\n","^>>+ You now have the <b>blessing of fire</b>.","\n","ev",true,"/ev",{"VAR=":"BFR","re":true},{"->":".^.^.opts"},["^You feel a warmth spread through your body. Your eyes glitter like sunlight off a knight’s shield and your heart swells with courage.","\n","^“Seek the Scorched Keep,” the dryad whispers. “The Coiled Crown awaits you there.”","\n","^The bell tolls one final time, and the dryad melts back into the tangle of branches beneath your boots.","\n","^>>+ You now have the <b>blessing of iron</b>.","\n","ev",true,"/ev",{"VAR=":"BIR","re":true},{"->":".^.^.^.opts"},{"#n":"blessing_of_iron"}],null]}],null],"location_mossy_cave":[["#","^AUDIOLOOP: music/forest.mp3","/#","#","^CLEAR","/#","^<h3>Mossy Cave</h3>","\n","^Streams of dirty water pour from an opening in the ceiling of this cramped cave, the droplets falling onto a long-since expired campfire on the ground.","\n","^The fading purple daylight glimmers off an ornate bell visible through the hole high above, far out of reach.","\n","^A low tunnel leads further into the cave. When your eyes adjust to the gloom, you can see the flickering of candles at the tunnel’s far end.","\n","ev",{"VAR?":"BMP"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You spy amid the charred wood and rocks at your feet a scroll tube covered in soot.",{"->":".^.^.^.19"},null]}],"nop","\n",["ev","str","^Take the scroll tube","/str",{"VAR?":"BMP"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Push farther into the cave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^You rescue the scroll tube from the spent campfire and brush off the soot with gloved fingers.","\n","^Pulling open the stopper, a piece of dirty parchment falls into your hands. Unfurling it, you see it is a crudely drawn map showing many [red]twisting path[/red] leading toward a domed structure.","\n","^>>+ You now have the <b>burnt map</b>.","\n","ev",true,"/ev",{"VAR=":"BMP","re":true},{"->":".^.^"},null],"c-1":["^ ",{"->":"witch_cave"},"\n",null],"#n":"opts"}],null],null],"witch_cave":[["#","^IMAGE: images/witch-77.jpg","/#","^A black-clad young witch sits atop a bed of branches she has made for herself in this claustrophobic cave. The hovel is lit only by pungent candles and the flickering faces of jacko’- lanterns. Her gaze is cast downward, her painted fingers smudging wax across the skull of some captured forest creature. She [red]sings a gloomy song[/red] in an unknown language.","\n","ev",{"VAR?":"WFG"},"/ev",[{"->":".^.b","c":true},{"b":["^ The witch looks up, breathes deep of the air, and smiles. “I smell that figurine you carry, seeker of the crown. If you like, I can melt that figurine into a healing liquid to fill that empty vial of yours. Or, if you desire something stronger, you might offer it to my sister beneath the Scorched Keep, who can use it to mix a much more potent elixir.”",{"->":".^.^.^.9"},null]}],"nop","\n",["ev","str","^Give the witch the wax figurine","/str",{"VAR?":"WFG"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Leave the witch be and exit the cave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^The witch takes the phoenix figurine and tosses it into a tin pot boiling atop a bed of glowing coals. Stirring it with a thin bone, the figurine melts into a thick sludge the color of rotten berries.","\n","^She motions in a hurry for your empty vial. “Quick, before it sets!”","\n",["ev","str","^Give the witch the empty vial","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^You hand her the vial and she pours the substance in, the glass fogging up from the heat.","\n","^She hands the heavy vial back to you and picks up her waxcoated skull once more. “Be safe, seeker.”","\n","^>>+ You now have the <b>healing potion</b>.","\n","^>>- You no longer have the <b>wax figurine</b>.","\n","ev",false,"/ev",{"VAR=":"EPV","re":true},"ev",true,"/ev",{"VAR=":"PTN","re":true},"ev",false,"/ev",{"VAR=":"WFG","re":true},{"->":".^.^.^.^"},null]}],null],"c-1":["^ ",{"->":"location_cave_exit"},"\n",null],"#n":"opts"}],null],null],"location_cave_exit":[["#","^AUDIOLOOP: false","/#","^Thin sheets of water pour down the side of a root-choked cliff face. An opening in the cliff face draped in shadows is visible behind the waterfall.","\n","^Peering up toward the deepening violet sky, you see handholds carved into the rock. They ascend toward a crumbling stone structure nestled among the misty trees atop the cliff. A dim lantern burns on a ruined wall up above.","\n","^The air smells of incense.","\n","ev","str","^Climb up toward the stone structure","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Squeeze through the cave opening","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go along the dirt path","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"location_handmaidens_shrine"},"\n",null],"c-1":["^ ",{"->":"location_mossy_cave"},"\n",null],"c-2":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}],null],"location_holy_gatehouse":["#","^AUDIOLOOP: music/castle.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/holy-gatehouse-43.jpg","/#","^<h3>Holy Gatehouse</h3>","\n",{"->":"gatehouse_entrance"},null],"gatehouse_entrance":[["^Curved rafters support a domed ceiling that rises high above this shadowy gatehouse. Ornate columns set into the walls and pillars are carved in the likeness of a crowned woman in flowing robes decorated with swirling fire.","\n","^Polished marble stairs rise along the walls, curving upward toward a heavy brass door high above that leads into the stone of the cliff face itself.","\n","^A statue of an armored paladin stands in the center of the gatehouse amid a ring of pillars, shield and cudgel gripped tightly in gauntleted hands painted the color of embers. A kneeling stone rests at the statue’s feet.","\n","ev","str","^Kneel at the statue","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Climb the stairs toward the brass door","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go to the forest","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"kneel_paladin"},"\n",null],"c-1":["^ ",{"->":"gatehouse_brass_doors"},"\n",null],"c-2":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}],null],"kneel_paladin":[["#","^IMAGE: images/paladin-84.jpg","/#","^You lower your sword and kneel at the paladin statue’s feet. When you feel the scratch of the stone against your knees, your weight shifts and it descends an inch into the floor with a soft click.","\n","^A tentative young woman’s voice rings from within the brass statue as if it were hollow:","\n","^“This fortress stands as a monument to our great queen. It is a haven to those who would move through this world in the same manner she once did, when the bonfires still burned. Pray tell, traveler, do you lead, or is it better to follow?”","\n","ev","str","^Say “I lead”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Say “It is better to follow”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Say nothing and stand back up","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"say_lead"},"\n",null],"c-1":["^ ",{"->":"say_follow"},"\n",null],"c-2":["^ ",{"->":"gatehouse_entrance"},"\n",null]}],null],"say_follow":[["^The voice inside the hollow brass paladin statue breathes a ringing sigh of despair.","\n","^“It brings me no joy to do this.”","\n","^Clanging gears rattle within the statue, followed by a cloud of noxious dust that issues from the seams of the breastplate.","\n","ev","str","^Jump up from the kneeling stone","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["#","^IMAGE: images/fire-19.jpg","/#","^You jump up from the kneeling stone, but not before the billowing dust surrounds you, filling your mouth, nose, and eyes.","\n","^Through fits of painful coughing and choking, you fall to the ground, the paladin statue towering over you as your vision ","ev",{"VAR?":"PTN"},"/ev",[{"->":".^.b","c":true},{"b":["^blurs",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["^fades to tearful darkness",{"->":".^.^.^.11"},null]}],"nop","^.","\n","ev","str","^Drink the healing potion","/str",{"VAR?":"PTN"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Try to breathe","/str",{"VAR?":"PTN"},"!","/ev",{"*":".^.c-2","flg":5},{"c-1":["\n","^You feel for the healing potion at your side and drink it, the chalky fluid soothing your burning insides. Still on your back, you wipe tears from your swollen eyes.","\n","^>>- You no longer have the <b>healing potion</b>.","\n","ev",false,"/ev",{"VAR=":"PTN","re":true},["ev","str","^Move away from statue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gatehouse_entrance"},"\n",null]}],null],"c-2":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^You hear quiet sobbing from within the hollow breastplate of the statue.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}]}],null],"say_lead":[["^The voice inside the hollow brass paladin statue breathes a ringing sigh of relief. “Just as our queen demands.”","\n","^Clanging gears rattle within the statue, followed by a cloud of dust that issues from the seams of the breastplate. The visor of the helmet opens with a creak.","\n","ev","str","^Peer inside the helmet","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["^You stand from the kneeling stone and peer inside the helmet to see a dimly glowing chunk of everburning coal.","\n","ev",{"VAR?":"EBC"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Feeling expectant eyes upon you, you grab the coal with gloved hands, the warmth comforting.","\n","^>>+ You now have the <b>everburning coal</b>.","\n","ev",true,"/ev",{"VAR=":"EBC","re":true},{"->":".^.^.^.7"},null]}],"nop","\n","ev","str","^Move away from statue","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["^ ",{"->":"gatehouse_entrance"},"\n",null]}]}],null],"gatehouse_brass_doors":[["^Deep shadows dance across the sprawling baroque reliefs set into the face of this heavy brass door.","\n","^The door has a seam down the middle but no visible handles.","\n","^A polished plaque riveted onto the door reads: “Speak the name of our holy queen to pass into her sacred keep.”","\n","^You think back to some of the names you’ve heard in passing during your journey to claim the Coiled Crown ...","\n","ev","str","^Speak “Iryea”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Speak “Kaldera”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Speak “Euryale”","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Say nothing and go back down the stairs","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"gatehouse_brass_doors_death"},"\n",null],"c-1":["^ ",{"->":"p50"},"\n",null],"c-2":["^ ",{"->":"gatehouse_brass_doors_death"},"\n",null],"c-3":["^ ",{"->":"gatehouse_entrance"},"\n",null]}],null],"gatehouse_brass_doors_death":[["^You hear the sound of gears turning and tumblers clicking from within the heavy brass door. You step back, expecting a trap, but instead are greeted with a final loud thunk, the sound of a heavy lock sliding into place, and then silence.","\n","ev","str","^Speak other names","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["^You try to speak the other names you’ve heard on your journey, but to no avail. Undeterred, you spend the next several hours seeking another path forward, but find no means to bypass the great door.","\n","ev","str","^Wait","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":".^.^.^.g-1"},null]}],"g-1":["#","^AUDIOLOOP: music/death.mp3","/#","^Hours turn to days and days turn to weeks, until finally you collapse from hunger, dirty fingers scratching at the sealed brass door.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}],null],"p50":[["#","^IMAGE: images/door-72.jpg","/#","^You hear the sound of gears turning and tumblers clicking from within the heavy brass door.","\n","^You step back, expecting a trap, but instead are greeted with a loud thunk and the groaning of the door slowly opening into an unworked dark tunnel that leads directly into the cliff face.","\n","ev","str","^Enter through the brass door","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go back down the stairs","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Leave the gatehouse and go back out into the forest","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"p72"},"\n",null],"c-1":["^ ",{"->":"gatehouse_entrance"},"\n",null],"c-2":["^ ",{"->":"location_forest_cliff_face"},"\n",null]}],null],"p72":[["^The dark, unworked tunnel stretches hundreds of feet into the cliff face before giving way to smooth walls of tightly fitted limestone.","\n","^Silvery shafts of daylight shine through narrow barred windows onto an unassuming wooden door painted red, the flecks of peeling paint like a path of rose petals.","\n","^The door’s iron bands rattle with each gust of wind that howls from outside.","\n","ev","str","^Open the door and step outside","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Go back to the gatehouse","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"location_bridge_of_hollows"},"\n",null],"c-1":["^ ",{"->":"gatehouse_entrance"},"\n",null]}],null],"location_bridge_of_hollows":[["#","^CHECKPOINT","/#","#","^AUDIOLOOP: music/castle.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/bridge-of-hollows-12.jpg","/#","^<h3>Bridge of Hollows</h3>","\n","^An enormous keep built from soot-covered limestone rises around you, its looming towers and soaring battlements piercing the gray clouds that hang low in the freezing sky.","\n","^Wind whips through abandoned alleys, gloomy alcoves, and decaying courtyards all draped in the shadow of a colossal bridge overhead that leads to the keep entrance.","\n","^A flight of stone steps littered with discarded spears rises toward the bridge above.","\n","ev","str","^Climb the stairs up to the bridge","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Explore the castle grounds","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go back to the gatehouse","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"limestone_bridge"},"\n",null],"c-1":["^ ",{"->":"mausoleums"},"\n",null],"c-2":["^ ",{"->":"location_holy_gatehouse"},"\n",null]}],null],"limestone_bridge":[["^This colossal limestone bridge is lined with statues of armored warriors, their shields engraved with the likeness of a fearsome woman with fanged teeth and writhing snakes for hair.","\n","^The bridge, wide enough for five merchant’s carts to ride side by side, leads to a gargantuan set of double doors inlaid with gems that shimmer the color of fire even in the overcast daylight.","\n","^The doors are open ever so slightly, allowing you to slip through and enter the imposing keep.","\n","ev","str","^Slip through the gargantuan doors","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Climb down the stairs toward the castle grounds","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"location_scorched_keep"},"\n",null],"c-1":["^ ",{"->":"location_bridge_of_hollows"},"\n",null]}],null],"mausoleums":[["#","^CLEAR","/#","#","^IMAGE: images/mausoleums-48.jpg","/#","^Wandering the gray, windswept castle grounds, you come across a small graveyard nestled in the shadow of the great stone bridge that looms above you. Toppled and cracked headstones lie face down in the dirt forming a cobblestonelike path toward [red]three mausoleums[/red] that stand among the overgrown roots and weeds.","\n","^A sign creaks in the wind. The runes etched onto its surface tell that those interred in this honored graveyard perished while protecting others from the ravenous Carnophage.","\n","ev","str","^Watch a wandering ghost","/str",{"VAR?":"ELX"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^Inspect the open mausoleum","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Inspect the closed mausoleum","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Inspect the cracked mausoleum","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Climb the stairs up to the bridge","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^ ",{"->":"mausoleum_ghost"},"\n",{"#f":5}],"c-1":["^ ",{"->":"mausoleum_open"},"\n",null],"c-2":["^ ",{"->":"mausoleum_closed"},"\n",null],"c-3":["^ ",{"->":"mausoleum_cracked"},"\n",null],"c-4":["^ ",{"->":"limestone_bridge"},"\n",null]}],null],"mausoleum_open":[["^The door of this decrepit mausoleum has been pried open, the bent hinges pulled free from the jamb and cast aside in the nearby weeds.","\n","^Peering inside, a skeleton reclines on a marble slab, its bones still encased in a suit of rusted plate mail. It clutches a battered two-handed sword in ancient gauntlets, the blade so dull it would struggle to cut parchment. Whatever other relics this warrior was interred with have long since been plundered.","\n","#","^IMAGE: images/shape-pillar.png","/#","^A threadbare tapestry hangs on the mausoleum wall behind the slab. A crude symbol — [red]three lines in the shape of a pillar[/red] — is inked onto the tapestry.","\n","ev","str","^Inspect the other mausoleums","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mausoleums"},"\n",null]}],null],"mausoleum_closed":[["^The door of this decrepit mausoleum is sealed with heavy stone and bands of riveted iron.","\n","^A threadbare tapestry dangles from a pole that stands next to the door, the fabric billowing in the cold air that whips through this cemetery in the shadow of the great bridge above.","\n","#","^IMAGE: images/shape-cross.png","/#","^The image of a woman in flowing priestess robes has been embroidered onto the tapestry. A nimbus glows above her head and her delicately rendered hands clutch a holy symbol — [red]three lines in the shape of a cross[/red].","\n","ev","str","^Inspect the other mausoleums","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mausoleums"},"\n",null]}],null],"mausoleum_cracked":[["^The door of this decrepit mausoleum is sealed with heavy stone and bands of riveted iron.","\n","^Peering through a crack in the side of the mausoleum, you can barely make out a robed skeleton resting atop a slab. Talismans and bracelets dangle from the interred sorceress’s feeble bones. Moldy tomes lie stacked on the floor, their pages swollen and rotted with moisture.","\n","#","^IMAGE: images/shape-bonfire.png","/#","^A threadbare tapestry hangs on the mausoleum wall behind the slab. A crude symbol — [red]three lines in the shape of a bonfire[/red] — is inked onto the tapestry.","\n","ev","str","^Inspect the other mausoleums","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mausoleums"},"\n",null]}],null],"mausoleum_ghost":[["^A ghostly gorgon in funeral garb wanders the cemetery, stopping occasionally in an attempt to prop up one of the toppled headstones. She lets out a quiet sob each time her ethereal fingers pass through the stone. The gorgon then turns to face you, her petrifying eyes hidden behind a dark funerary veil.","\n","^“My devoted daughter,” the gorgon wails. “She is not buried here among the other honored dead. I cannot know peace until I find her resting place. So deep was her faith that, with her final breaths in this world, she [red]sang my prayer[/red].”","\n","^She then turns her gaze away and continues to drift through this graveyard in the cold shadow of the colossal bridge.","\n","ev","str","^Leave the ghost to her mourning","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mausoleums"},"\n",null]}],null],"location_scorched_keep":[["#","^AUDIOLOOP: music/cathedral.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/scorched-keep-83.jpg","/#","^<h3>Scorched Keep</h3>","\n","^An ornate dome, truly cyclopean in scope, towers over a great hall ringed by columns, archways, and balconies.","\n","^The scent of a burning campfire fills the entire great hall, wisps of smoke barely visible in the soft light that pours down from a skylight high above.","\n","^In the peripheral alcoves of the hall where the overcast daylight is dimmest, charred signet rings lie discarded in heaps.","\n","^The ashes of tapestries pulled down from their now-rusted chains drift on an unseen breeze from toppled braziers.","\n","ev","str","^Look around","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"scorched_keep_entrance"},"\n",null]}],null],"scorched_keep_entrance":[["#","^IMAGE: images/inscriptions-83.jpg","/#","^A wrought-iron flight of spiral steps ascends toward a balcony on the second floor of the great hall. In the center of the hall, a lift on heavy pulleys and chains dangles in a tower-like station.","\n","^Straight ahead, beyond both the spiral stairs and the lift station, is an archway decorated with tapestries depicting a fearsome armored woman driving a spear down into the maw of a writhing kraken.","\n","^A young woman draped in flowering wreaths sits on the floor near the lift station, her dirt-covered fingers sorting through a  stiff deck of faded tarot cards.","\n","ev","str","^Climb the spiral stairs to the second-floor balcony","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Descend the lift into darkness below","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Pass through the archway ahead","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Approach the fortune teller","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"location_limestone_balcony"},"\n",null],"c-1":["^ ",{"->":"location_lift"},"\n",null],"c-2":["^ ",{"->":"scorched_keep_archway"},"\n",null],"c-3":["^ ",{"->":"fortune_teller"},"\n",null]}],null],"scorched_keep_archway":[["#","^IMAGE: images/obsidian-door-56.jpg","/#","^Holy symbols, coins, fragrant candles, and other offerings lie scattered at the foot of an imposing door hewn from obsidian. The exotic stone is unlike anything you’ve seen elsewhere in the keep or the surrounding forest. Columns on either side of the door depict an armored woman driving her spear down into the tendrils of a kraken.","\n","^The surface of the obsidian door heaves and shifts, forming into an imposing skull the size of a boulder. Embers smolder in its single leering eye and across its flicking serpent’s tongue. The skull looks ready to lunge from the door and swallow you.","\n","ev","str","^Strike the skull’s eye with your longsword","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Strike the skull’s tongue with your longsword","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Flee","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"death_scorched_keep"},"\n",null],"c-1":["^ ",{"->":"p95"},"\n",null],"c-2":["^ ",{"->":"scorched_keep_entrance"},"\n",null]}],null],"p95":[["^You lash out at the enormous skull, the echoing of your shout drawing the sound of scuffling footsteps from behind you. Turning your head, you can see the fortune teller, draped in flowering wreaths, peeking out at you from behind a pillar.","\n","^You cleave the obsidian skull’s tongue with your longsword, severing it from the skull’s maw with a thunderous crack and a shriek from the fortune teller. Its single eye crumbles to dust.","\n","^The obsidian skull lets out a groan like metal buckling under the weight of stone and two more organs glow like embers within its imposing form: a heart and a brain.","\n","ev","str","^Strike the skull’s heart with your longsword","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Strike the skull’s brain with your longsword","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"location_white_fog_gate"},"\n",null],"c-1":["^ ",{"->":"death_scorched_keep"},"\n",null]}],null],"death_scorched_keep":["#","^AUDIOLOOP: music/death.mp3","/#","^You lash out at the enormous skull, the echoing of your shout drawing the sound of scuffling footsteps from behind you. Turning your head, you can see the fortune teller, draped in flowering wreaths, peeking out at you from behind a pillar.","\n","^Your blade shatters when it strikes the obsidian skull, which coils outward from the door like a striking serpent. Before you can turn to flee or call to the fortune teller for help, the skull bites down on you and swallows your body whole.","\n","^Darkness and the painful grinding of stone envelops you.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null],"location_white_fog_gate":[["#","^CLEAR","/#","#","^IMAGE: images/white-fog-gate-41.jpg","/#","^<h3>White Fog Gate</h3>","\n","^You plunge your longsword into the glowing heart of embers. There is a crash of thunder and the skull explodes in a concussive hail of obsidian shards, revealing an archway filled with white fog. The archway is set into a mosaic depicting an armored woman calling down a fiery conflagration upon her enemies. The fortune teller cheers, then hides.","\n","^Numberless souls have journeyed into the netherworld in search of the Coiled Crown, but looking upon this fearsome mural beyond the destroyed obsidian skull, you are certain that you are the only mortal to pass this way in aeons.","\n","ev",{"VAR?":"RVK"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ You hear a quiet whisper coming from the fog, \"Seek revelation\". The fog gate does not let you enter. ",{"->":".^.^.^.17"},null]}],"nop","\n","ev","str","^Enter the Gate","/str",{"VAR?":"RVK"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Go back to Scorched Keep","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"location_throne_of_cinder"},"\n",null],"c-1":["^ ",{"->":"location_scorched_keep"},"\n",null]}],null],"fortune_teller":[["ev",false,"/ev",{"VAR=":"tarot_death","re":true},"^You approach the young woman sitting cross-legged on the cold limestone floor. She places her deck of tarot cards at her side and looks up at you.","\n","^“Many of the [red]flowers[/red] in this forest can heal the sick,” she says, running her fingers along the garlands that cover her body.","\n","^“The Carnophage came too quickly. The extinct people of this land had no time to learn how to use the blessings of the forest around them — a pity, really, as Gaea provides remedies for all ills, even those as dreadful as the Carnophage.”","\n",["ev","str","^“Tell me my fortune.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Give her flowers with black ribbon","/str",{"VAR?":"FLB"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Give her flowers with white ribbon","/str",{"VAR?":"FLW"},"/ev",{"*":".^.c-2","flg":5},"ev","str","^Leave the young woman be","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Venture back out into the Netherworld Forest","/str",{"VAR?":"tarot_death"},"/ev",{"*":".^.c-4","flg":5},{"c-0":["^ ",{"->":".^.^.^.tell_fortune"},"\n",{"->":".^.^.^.tell_fortune"},{"#f":5}],"c-1":["^ ",{"->":".^.^.^.card_blessing_of_fire.card_blessing_of_iron.card_tarot.flowers_roses"},"\n",{"->":".^.^.^.tell_fortune"},null],"c-2":["^ ",{"->":".^.^.^.card_blessing_of_fire.card_blessing_of_iron.card_tarot.flowers_roses.flowers_lilacs"},"\n",{"->":".^.^.^.tell_fortune"},null],"c-3":["^ ",{"->":"scorched_keep_entrance"},"\n",{"->":".^.^.^.tell_fortune"},null],"c-4":["^ ",{"->":"location_forest_cliff_face"},"\n",{"->":".^.^.^.tell_fortune"},null],"#n":"fortune_teller_opts"}],{"tell_fortune":["#","^IMAGE: images/tarot-86.jpg","/#","^The young woman smiles and collects the cards at her feet.","\n","^With each snapping shuffle of the deck, the sound echoes through the colossal great hall and kicks up clouds of crushed flower petals.","\n","ev","str","^Draw a card","/str","/ev",{"*":".^.c-5","flg":4},{"c-5":["\n",["ev",{"VAR?":"BFR"},"/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^.card_blessing_of_fire"},{"->":".^.^.^.4"},null]}],["ev",{"VAR?":"BIR"},"/ev",{"->":".^.b","c":true},{"b":["\n",{"->":".^.^.^.^.^.card_blessing_of_fire.card_blessing_of_iron"},{"->":".^.^.^.4"},null]}],[{"->":".^.b"},{"b":["\n",{"->":".^.^.^.^.^.card_blessing_of_fire.card_blessing_of_iron.card_tarot"},{"->":".^.^.^.4"},null]}],"nop","\n",{"->":".^.^.^.card_blessing_of_fire"},null]}],"card_blessing_of_fire":["^You draw a card from the top of the deck, the rough parchment scraping against your gloved fingertips.","\n","^Before you can turn the card to reveal its face, the card between your fingers erupts in flames!","\n","^You shout and shake the ashes from your fingertips that still glow a dull red like embers. The fortune teller slides back in surprise and pulls the rest of her tarot cards close to her chest.","\n","^>>> Your <b>blessing of fire</b> incinerated the card.","\n",{"->":".^.^.fortune_teller_opts"},["^You flip the card to reveal its face. Looking down, you see that you have drawn the High Priestess.","\n","#","^IMAGE: images/tarot-high-priestess.jpg","/#","^The fortune teller looks up at you with eyes of deep green and speaks.","\n","^“I sense that a priestess of this land has gifted you with a divine blessing, seeker of the crown. I pray that you [red]trust in this blessing[/red] when you come to face the mortal danger that dwells in this haunted Keep.”","\n",{"->":".^.^.^.fortune_teller_opts"},["ev",true,"/ev",{"VAR=":"tarot_death","re":true},"^You flip the card to reveal its face. Looking down, you see that you have drawn Death.","\n","#","^IMAGE: images/tarot-death.jpg","/#","^The fortune teller bites her lip and whispers without looking up from the card.","\n","^“You are in grave danger, seeker of the crown. I sense there is something important you have left behind [red]outside the walls of this Keep[/red]. I pray that you find it, lest you join the wandering chorus of ghosts.”","\n",{"->":".^.^.^.^.fortune_teller_opts"},["^You hand the fortune teller the bundle of dead flower stems bound with [red]black ribbon[/red].","\n","^She pulls the stems close to her face before smelling them, tasting them, and rolling them between her painted fingers. She holds the stems up into the dim light that shines down through the windows high above, her deep green eyes drinking in every detail.","\n","^“[red]Roses[/red],” the fortune teller finally whispers. “These bare stems were once roses, red with the burning passion of those who loved their queen so dearly.”","\n",{"->":".^.^.^.^.^.fortune_teller_opts"},["^You hand the fortune teller the bundle of dead flower stems bound with [red]white ribbon[/red].","\n","^She pulls the stems close to her face before smelling them, tasting them, and rolling them between her painted fingers. She holds the stems up into the dim light that shines down through the windows high above, her deep green eyes drinking in every detail.","\n","^“[red]Lilacs[/red],” the fortune teller finally whispers. “These bare stems were once lilacs, fragrant totems of eternal youth and renewal promised by the great queen that once ruled here.”","\n",{"->":".^.^.^.^.^.^.fortune_teller_opts"},{"#n":"flowers_lilacs"}],{"#n":"flowers_roses"}],{"#n":"card_tarot"}],{"#n":"card_blessing_of_iron"}],null]}],null],"location_lift":[["#","^AUDIOLOOP: false","/#","#","^CLEAR","/#","^The cage-like lift comes to rest atop a circular landing of stone painted like a burning sun disk. Rusted pulleys and chains sit concealed in the unworked walls behind glistening stalagmites.","\n","^A flight of broad limestone steps curves down toward flickering torchlight and the ceaseless echoing of dripping water — the keep’s cistern.","\n","^A portion of the wall has crumbled away near the lift, revealing a once-hidden cave tunnel littered with bones. Wet bare footprints lead into the tunnel.","\n","ev","str","^Follow the stairs down into the cistern","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Step through the ruined wall into the cave","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Ascend the lift to Scorched Keep","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"location_cursed_gateway"},"\n",null],"c-1":["^ ",{"->":"location_lost_catacombs"},"\n",null],"c-2":["^ ",{"->":"location_scorched_keep"},"\n",null]}],null],"location_cursed_gateway":[["#","^AUDIOLOOP: false","/#","#","^CLEAR","/#","#","^IMAGE: images/cursed-gateway-74.jpg","/#","^<h3>Cursed Gateway</h3>","\n","^Dark algae-coated water fills this vast cistern that sprawls under the Scorched Keep. Dim torches sputter and crackle beneath an endless spray of water that drips from the glistening ceiling above.","\n","^A ledge just wide enough for you to shimmy across leads along the cistern wall toward an open portcullis to the left.","\n","^A small rowboat floats nearby, moored to a piton with frayed rope. The vessel looks sturdy despite its age, though you’re not sure it could support the weight of more than one person.","\n","ev","str","^Follow the ledge into the portcullis","/str",{"VAR?":"SNK"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Climb into the rowboat","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go back to the lift","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"portcullis"},"\n",null],"c-1":["^ ",{"->":"rowboat"},"\n",null],"c-2":["^ ",{"->":"location_lift"},"\n",null]}],null],"rowboat":[["#","^IMAGE: images/skulls-06.jpg","/#","^You climb into the rowboat as gingerly as you can manage. The swollen wooden planks groan beneath your boots and the frayed rope mooring the vessel to the cistern entrance slowly begins to pull apart.","\n","ev","str","^Row a boat","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",["ev",{"VAR?":"BIR"},"/ev",{"->":".^.b","c":true},{"b":["\n",{"->":"death_cursed_gateway"},{"->":".^.^.^.3"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"p53"},{"->":".^.^.^.3"},null]}],"nop","\n",null]}],null],"death_cursed_gateway":["#","^AUDIOLOOP: music/death.mp3","/#","^For a moment, you feel steady. Suddenly, the wooden boat buckles and splinters beneath your boots and you plunge into the dark, dirty water.","\n","^As if dragged down by supernatural iron weights, you sink deeper into the frigid water of the cistern, the dim torchlight above slowly fading to an all-encompassing darkness.","\n","^>>> Your <b>blessing of iron</b> weighed you down.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null],"p53":[["#","^IMAGE: images/cistern-53.jpg","/#","^You manage to steady the vessel. Two cracked oars lie underneath the boat’s bench, which you pull from the grime and dip into the water.","\n","^After rowing for a few minutes, you come to a large reservoir at the end of the maze-like cistern filled with sediment and slimes of various sickening colors.","\n","^The mottled remains of a squid-like creature decompose in the corner of the reservoir, tiny grubs eating at the rubbery flesh that shimmers in the dim torchlight.","\n","^You feel a [red]chilling presence[/red].","\n","ev","str","^Watch the ghosts","/str",{"VAR?":"ELX"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Row back to the cistern","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"cursed_gateway_ghosts"},"\n",null],"c-1":["^ ",{"->":"location_cursed_gateway"},"\n",null]}],null],"cursed_gateway_ghosts":[["^A phantasmal woman hovers here, her eyes darkened by tears that drip into the murky water beneath her feet. A pile of slain ethereal knights surround her — each has their helmet removed to reveal sucking squid-like creatures covering their faces.","\n","^A ghostly young girl sits in the shallow water near the phantasmal woman. She bundles together colorless phantom flowers taken from the [red]garlands atop her head[/red] and sets them afloat on the cistern’s current.","\n","ev","str","^Row back to the cistern","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"location_cursed_gateway"},"\n",null]}],null],"portcullis":[["#","^IMAGE: images/candles-16.jpg","/#","^A pair of brass sarcophagi recline in this damp tomb hidden beneath the Scorched Keep. Wet, muddy hand prints cover both sarcophagi, as if some frail creature had slithered from the cistern and tried to lift open the heavy cover plates.","\n","^Both sarcophagi are identical, except for the coiled patterns painted onto the cover plates: [red]black paint[/red] applied to the sarcophagus on the left, [red]white paint[/red] on the right.","\n","^Bouquets of dead flower stems float in the ankle-high water at the foot of each sarcophagus, the color of the ribbons binding the stems matching the color used to paint the sarcophagi.","\n",["ev","str","^Gather up the bouquets of dead flowers","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Open the sarcophagus painted black","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Open the sarcophagus painted white","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Return to the cistern","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":".^.^.^.take_flowers"},"\n",{"->":".^.^.^.take_flowers"},{"#f":5}],"c-1":["^ ",{"->":".^.^.^.take_flowers.sarcophagus_black"},"\n",{"->":".^.^.^.take_flowers"},null],"c-2":["^ ",{"->":".^.^.^.sarcophagus_white"},"\n",{"->":".^.^.^.take_flowers"},null],"c-3":["^ ",{"->":"location_cursed_gateway"},"\n",{"->":".^.^.^.take_flowers"},null],"#n":"opts_portcullis"}],{"take_flowers":["^You collect the bundles of dead flower stems from the murky puddles of water that lap at the base of each sarcophagus.","\n","^>>+ You now have a <b>bouquet of dead flower stems bound in black ribbon</b>.","\n","ev",true,"/ev",{"VAR=":"FLB","re":true},"^>>+ You now have a <b>bouquet of dead flower stems bound in white ribbon</b>.","\n","ev",true,"/ev",{"VAR=":"FLW","re":true},{"->":".^.^.opts_portcullis"},["^With a groan, you throw open the sarcophagus painted with flowering black lines.","\n","^Before the cover plate can even crash to the floor, a volley of whistling darts sprays out from within the sarcophagus, their poisonous tips piercing your leather armor and bruised skin.","\n","^A numbing cold spreads through your body and you fall to your knees.","\n","ev","str","^Drink the healing potion","/str",{"VAR?":"PTN"},"/ev",{"*":".^.c-4","flg":5},"ev","str","^Try to get away","/str",{"VAR?":"PTN"},"!","/ev",{"*":".^.c-5","flg":5},{"c-4":["\n","#","^IMAGE: images/water-42.jpg","/#","^Quickly, you pull the healing potion from your pack and drink the chalky fluid. The numbness and chills subside and you stagger to your feet.","\n","^Just as you recover your balance against the slimy walls, the ground beneath your feet gives way. Both sarcophagi tumble into a deep pool of pitch-black water — and if you don’t move quickly, you will as well.","\n","^>>- You no longer have the <b>healing potion</b>.","\n","ev",false,"/ev",{"VAR=":"PTN","re":true},"^The sarcophagi have sunk into the cistern [SNK].","\n","ev",true,"/ev",{"VAR=":"SNK","re":true},["ev","str","^Return to the cistern","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"location_cursed_gateway"},"\n",{"->":"portcullis.0.sarcophagus_white"},null]}],null],"c-5":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^The last thing you hear before you lose consciousness is the soft brushing of the dead bouquets beneath your body and the ceaseless dripping of water into the cistern behind you.","\n","^>>! YOU DIED","\n",{"->":"endgame"},{"->":".^.^.^.^.sarcophagus_white"},null],"#n":"sarcophagus_black"}],null],"sarcophagus_white":["^With a groan, you throw open the sarcophagus painted with flowering white lines. The heavy cover plate crashes to the floor, the impact sending thousands of water droplets splashing down into the cistern behind you.","\n","ev","str","^Look inside","/str","/ev",{"*":".^.c-6","flg":4},{"c-6":["\n",{"->":".^.^.^.g-0"},null]}],"g-0":["^You see inside the tomb a cage-like effigy of a woman made from brass wire, its interior stuffed with dessicated lilac petals. You reach into the sarcophagus, the stiff petals crumbling from your touch. A gentle voice fills your mind:","\n","^“Euryale’s prayer is the key to the Throne of Cinder and the Coiled Crown you seek.”","\n","^>>+ You have received the <b>revelation of Kaldera</b>.","\n","ev",true,"/ev",{"VAR=":"RVK","re":true},"ev","str","^Return to the cistern","/str","/ev",{"*":".^.c-7","flg":4},{"c-7":["^ ",{"->":"location_cursed_gateway"},"\n",null]}]}],null],"location_lost_catacombs":[["#","^AUDIOLOOP: false","/#","#","^CLEAR","/#","#","^IMAGE: images/voices-05.jpg","/#","^<h3>Lost Catacombs</h3>","\n","^Thousands of bones litter the walls and ground of this oncesealed maze of catacomb tunnels. Piles of ash drift like snow on an unseen draft, revealing tarnished keepsakes that crunch beneath your boots.","\n","^Drawing closer to the bones, you can see spots of sickly green discoloration — a sign of the Carnophage, no doubt. The air reeks of lye.","\n","^Three tunnels snake off into darkness. The discordant sound of different voices singing reverberates from deep within the catacombs.","\n","ev","str","^Follow the sound of joyous singing","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Follow the sound of gloomy singing","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Follow the sound of angry singing","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"catacombs_danger"},"\n",null],"c-1":["^ ",{"->":"catacombs_witch"},"\n",null],"c-2":["^ ",{"->":"catacombs_danger"},"\n",null]}],null],"catacombs_danger":[["#","^IMAGE: images/skull-17.jpg","/#","^You press your gloved hand against the wall and follow the curve of the tunnels toward the echoing voices in the dark.","\n","^Suddenly, you feel the ground sink ever so slightly beneath your boots. The singing halts.","\n","^Around you in the pitch darkness, you hear a skull tumble from its shelf and shatter against the ground, followed by the whipping of an arrow through the air.","\n","^A piercing pain and a damp warmth shoots through your neck. Groping with your fingers and struggling to breathe, you feel the shaft of an arrow protruding from your neck.","\n","ev","str","^Drink the healing potion","/str",{"VAR?":"PTN"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Try to pull the arrow","/str",{"VAR?":"PTN"},"!","/ev",{"*":".^.c-1","flg":5},{"c-0":["\n","^You fumble in the dark for your healing potion and drink it, the wound in your neck sealing up in an instant.","\n","^You hear another skull fall to the ground, and another, and still another until the darkness around you is filled with the sound of shattering bone and shooting arrows.","\n","^>>- You no longer have the <b>healing potion</b>.","\n","ev",false,"/ev",{"VAR=":"PTN","re":true},["ev","str","^Sprint back to the catacombs entrance","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"location_lost_catacombs"},"\n",null]}],null],"c-1":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^You try to pull the arrow, but your strength gives out and you tumble into a pile of shifting skeletons.","\n","^You hear another skull fall to the ground, and another, and still another until the darkness around you is filled with the sound of shattering bone and shooting arrows.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}],null],"catacombs_witch":[["#","^IMAGE: images/witch-57.jpg","/#","^A black-clad young witch sits atop a bed of branches she has made for herself in this claustrophobic cave. The hovel is lit only by pungent candles and flickering brass lanterns taken from the Scorched Keep above.","\n","^Her gaze is cast downward, her painted fingers smudging wax across the skull of some captured cave-dwelling creature. She sings a gloomy song in an unknown language.","\n",["ev",{"VAR?":"HMD"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ A scroll in a brass tube lies half-buried in the ashes that collect at your feet.",{"->":".^.^.^.5"},null]}],"nop","\n","ev","str","^Take the scroll","/str",{"VAR?":"HMD"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Give witch a wax figurine","/str",{"VAR?":"WFG"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Leave the witch be and go back to the lift","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^You pull the scroll from the mound of ashes and unfurl it.","\n","^When your eyes adjust to the dim light of the witch’s hovel, you can read that the scroll is a hymn of mending.","\n","^“Please, take it,” the witch hums. “With that forgotten hymn, you can restore that which has fallen to ruin in this dead world. I have no need for such magic — I am quite comfortable here in the rubble.”","\n","^>>+ You now have the <b>hymn of mending</b>.","\n","ev",true,"/ev",{"VAR=":"HMD","re":true},{"->":".^.^.^.g-0"},null],"c-1":["\n","^The witch looks up, breathes deep of the air, and smiles. She takes the phoenix figurine from you and tosses it into a hissing kettle at her feet. The wax figurine melts into a viscous substance that she mixes with flower petals and bits of bone.","\n","^“Sip this.” She pours the elixir into a wooden bowl and motions it toward you. You press the bowl to your lips and drink the pungent, chalky liquid. Whispering fills the air. “With this concoction, you may commune with the restless spirits that wander this haunted keep.”","\n","^>>+ You have drunk the <b>séance elixir</b>.","\n","^>>- You no longer have the <b>wax figurine</b>.","\n","ev",true,"/ev",{"VAR=":"ELX","re":true},"ev",false,"/ev",{"VAR=":"WFG","re":true},{"->":".^.^.^.g-0"},null],"c-2":["^ ",{"->":"location_lift"},"\n",{"->":".^.^.^.g-0"},null],"#n":"opts_witch"}],{"g-0":[{"->":".^.^.opts_witch"},null]}],null],"location_limestone_balcony":[["#","^AUDIOLOOP: false","/#","#","^CLEAR","/#","^You stand on a high and wide balcony of fitted limestone that rings the entire great hall of the Scorched Keep.","\n","^Statues of a crowned woman in flowing robes loom at regular intervals along the walls. The sword clutched in her hands is decorated with licking tongues of flame.","\n","^A baroque archway filled with pungent smoke is set into the wall near the stairs.","\n","^You spy across the great hall on the opposite side of the balcony a door made from stained glass in warm colors.","\n","ev","str","^Enter through the smoky archway","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Enter through the stained glass door","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Go down the spiral stairs into the main hall","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"location_shrine_of_euryale"},"\n",null],"c-1":["^ ",{"->":"location_abandoned_high_cathedral"},"\n",null],"c-2":["^ ",{"->":"location_scorched_keep"},"\n",null]}],null],"location_abandoned_high_cathedral":[["#","^AUDIOLOOP: music/cathedral.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/high-cathedral-22.jpg","/#","^<h3>Abandoned High Cathedral</h3>","\n","^Stained glass windows and joyous murals surround an airy cathedral lined with decorative columns and polished wooden pews. The scratching of tall evergreen trees against the stained glass windows echoes through the cathedral with each gust of wind from outside.","\n","^A statue of a smiling hooded woman holding a bowl of writhing snakes stands at the head of the cathedral, her gaze cast down on a marble altar draped with a gilded tapestry.","\n","^Skeletons, their bones flecked with patches of green discoloration, litter the pews, many still facing the high altar in positions of prayer.","\n",["ev","str","^Take the burial mask","/str",{"^->":"location_abandoned_high_cathedral.0.cathedral_altar"},"turns",0,"==",{"VAR?":"BMK"},"!","&&","/ev",{"*":".^.c-0","flg":5},"ev","str","^Read hymn of mending","/str",{"^->":"location_abandoned_high_cathedral.0.cathedral_altar.cathedral_stained_windows"},"turns",0,"==",{"VAR?":"HMD"},"&&","/ev",{"*":".^.c-1","flg":5},"ev","str","^Approach the altar","/str",{"^->":"location_abandoned_high_cathedral.0.cathedral_altar"},"turns",0,"!=","/ev",{"*":".^.c-2","flg":5},"ev","str","^Look upon the stained glass windows","/str",{"^->":"location_abandoned_high_cathedral.0.cathedral_altar.cathedral_stained_windows"},"turns",0,"!=","/ev",{"*":".^.c-3","flg":5},"ev","str","^Go back out onto the balcony","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["^ ",{"->":".^.^.^.cathedral_altar.cathedral_stained_windows.cathedral_hymn_of_mending.cathedral_burial_mask"},"\n",{"->":".^.^.^.cathedral_altar"},null],"c-1":["^ ",{"->":".^.^.^.cathedral_altar.cathedral_stained_windows.cathedral_hymn_of_mending"},"\n",{"->":".^.^.^.cathedral_altar"},null],"c-2":["^ ",{"->":".^.^.^.cathedral_altar"},"\n",{"->":".^.^.^.cathedral_altar"},null],"c-3":["^ ",{"->":".^.^.^.cathedral_altar.cathedral_stained_windows"},"\n",{"->":".^.^.^.cathedral_altar"},null],"c-4":["^ ",{"->":"location_limestone_balcony"},"\n",{"->":".^.^.^.cathedral_altar"},null],"#n":"cathedral_opts"}],{"cathedral_altar":["^Candles, incense, bowls, and polished bells sit meticulously arranged atop an altar covered in a gilded tapestry.","\n","^The statue of a hooded priestess clutching a bowl of stone snakes towers over you from behind the altar. The soft face of the priestess has been painted over with a hasty “X” the color of blood.","\n","ev",{"VAR?":"BMK"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ A brass burial mask rests atop the altar amid the other ceremonial relics.",{"->":".^.^.^.9"},null]}],"nop","\n",{"->":".^.^.cathedral_opts"},["#","^IMAGE: images/stained-windows-27.jpg","/#","^You gaze upon the stained glass windows that line the cathedral walls high above. Three windows, larger than the others, are set into the wall above the altar.","\n","^The first window shows a fiery-haired woman descending from the mountains, [red]burial mask in hand[/red].","\n","^The second window has [red]shattered[/red] and lies in a heap of prismatic glass shards on the cold limestone floor.","\n","^The third window shows the woman [red]pressing the mask to her face[/red], tongues of flame issuing from the now-red mask.","\n",{"->":".^.^.^.cathedral_opts"},["^You pull the hymn of mending from your pack and unroll it, the inked letters glowing faintly in the overcast daylight that shines through the stained glass windows above. You speak the words gently at first, but with each verse your voice grows louder and more confident until it echoes through the pews.","\n","^The shards of glass on the floor rattle and sparks of magic dance between them. You watch as the stained glass window pulls itself back together, piece by piece, revealing the hidden second image of the three-window sequence: the woman heating the burial mask in the flames of a [red]pyre atop which a slain armored warrior rests[/red]. A moment later, the stained glass window falls to pieces once again.","\n",{"->":".^.^.^.^.cathedral_opts"},["#","^IMAGE: images/altar-73.jpg","/#","^You lift the mask from the altar, the delicate features of the face reflecting your own stern visage.","\n","^>>+ You now have the <b>brass burial mask</b>.","\n","ev",true,"/ev",{"VAR=":"BMK","re":true},{"->":".^.^.^.^.^.cathedral_opts"},{"#n":"cathedral_burial_mask"}],{"#n":"cathedral_hymn_of_mending"}],{"#f":6,"#n":"cathedral_stained_windows"}],{"#f":6}]}],null],"location_shrine_of_euryale":[["#","^CHECKPOINT","/#","#","^AUDIOLOOP: music/shrine.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/shrine-of-euryale-38.jpg","/#","^<h3>Shrine of Euryale</h3>","\n",["^Thick smoke clings to every surface of this shrine lit by hundreds of everburning candles. Slabs of stone depicting a sneering woman with fanged teeth and snakes for hair lie propped against the tar-coated walls.","\n","^A stone idol kneels in the center of the shrine, her body decorated with coiled patterns, her hands folded in prayer above a brazier filled with expired coals.","\n","^An archway is set into the shrine walls to both the left and the right, each covered by a curtain of fire beads on copper thread.","\n","ev","str","^Inspect the stone idol","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Pass through the curtain of fire beads to the left","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Pass through the curtain of fire beads to the right","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Go back out onto the balcony","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":".^.^.^.stone_idol"},"\n",{"->":".^.^.^.stone_idol"},null],"c-1":["^ ",{"->":"curtain_left"},"\n",{"->":".^.^.^.stone_idol"},null],"c-2":["^ ",{"->":"curtain_right"},"\n",{"->":".^.^.^.stone_idol"},null],"c-3":["^ ",{"->":"location_limestone_balcony"},"\n",{"->":".^.^.^.stone_idol"},null],"#n":"shrine_entrance"}],{"stone_idol":["#","^IMAGE: images/stone-idol-75.jpg","/#","^The stone idol is hewn in the likeness of a long-haired woman in a tattered gown. Symbols of writhing snakes and dancing flames are etched onto her body, their curves drawing your eye toward the expired brazier at her feet.","\n","^An inscription is etched around her neck like a pendant. Tracing your fingers over the inscription, you see it is written in a language you can’t understand.","\n","ev",{"VAR?":"ELX"},"/ev",[{"->":".^.b","c":true},{"b":["^ A ghostly woman in a tattered gown sits on the back of the stone idol, her feet dangling impatiently as if waiting for someone.",{"->":".^.^.^.11"},null]}],"nop","\n",["ev","str","^Put everburning coal into the brazier","/str",{"VAR?":"EBC"},"/ev",{"*":".^.c-4","flg":5},"ev","str","^Watch the ghost","/str",{"VAR?":"ELX"},"/ev",{"*":".^.c-5","flg":5},"ev","str","^Examine the inscription closely","/str",{"VAR?":"RVK"},"/ev",{"*":".^.c-6","flg":5},"ev","str","^Step away from the idol","/str","/ev",{"*":".^.c-7","flg":4},{"c-4":["\n","^You toss the everburning coal into the brazier. Thick smoke billows from the glowing coals and forms into the shape of a coiled serpent with a woman’s face.","\n","^The smoky apparition hisses at you: “Sseek the ssinging ssister. Ssing her ssacred sscroll amid the [red]sstained and sshattered[/red].”","\n","^Just as quickly as the serpent-woman appeared, she dissipates.","\n",{"->":".^.^.^.^.g-0"},null],"c-5":["\n","^The ghost peers down at you from her perch atop the stone idol and speaks:","\n","^“My mother seeks in agony my final resting place in the [red]tombs outside this holy keep[/red]. Woefully, she does not know that my body and spirit are bound to this forgotten shrine, and so I must wait for her.”","\n",{"->":".^.^.^.^.g-0"},null],"c-6":["\n","^As if by some miracle, the heretofore unintelligible inscription across the collarbone of the stone idol shifts into writing you can understand:","\n","^“The maiden Althea with her gaze so disarming was said to be the daughter of Euryale herself. Rather than suffer the ravages of the Carnophage, Althea cried out to her divine mother and was turned to stone so that she would never know the cruel fever that heralded the end. So deep was Althea’s faith that she sang with her last breath: ‘Bless my serpent tongue and heart of stone.’”","\n",{"->":".^.^.^.^.g-0"},null],"c-7":["^ ",{"->":".^.^.^.^.shrine_entrance"},"\n",{"->":".^.^.^.^.g-0"},null],"#n":"stone_idol_options"}],null],"g-0":[{"->":".^.^.stone_idol.stone_idol_options"},null]}],null],"curtain_left":[["^This alcove is filled with the smoke of a burning pyre set against the far wall. Hundreds of everburning candles surround the pyre, the wax collecting into brass bowls etched with snaking patterns.","\n","#","^IMAGE: images/shape-pillar.png","/#","^Drawing nearer to the pyre, you see that only ashes remain of whatever proud servant of the queen was immolated here. However, a stone slab set into the base of the pyre has been etched with the symbol of [red]three lines in the shape of a pillar[/red].","\n",["ev","str","^Watch the ghosts","/str",{"VAR?":"ELX"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Put burial mask on","/str",{"VAR?":"BMK"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Go back out to the shrine","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^A phantom warrior in plate armor rests atop the pyre amid the flames.","\n","#","^IMAGE: images/shape-pillar.png","/#","^A ghostly priestess stands above the burning warrior, her silent lips mouthing a petition to the goddess Euryale to rid the deceased’s heart of guilt and make them light enough to pass into paradise.","\n",{"->":".^.^.^.g-0"},null],"c-1":["\n","^You hold the burial mask over the roiling pyre flames, the brass glowing red hot. After hesitating, you thrust the mask onto your face. You expect blinding pain, but instead feel only a gentle, soothing warmth, as if you had submerged your head into a bath. Suddenly, a gentle voice fills your mind:","\n","^“Euryale’s prayer is the key to the Throne of Cinder and the Coiled Crown you seek.”","\n","^The brass burial mask then melts away from your face, collecting into a pool of rapidly cooling metal at your feet.","\n","^>>+ You have received the <b>revelation of Kaldera</b>.","\n","^>>- You no longer have the <b>brass burial mask</b>.","\n","ev",true,"/ev",{"VAR=":"RVK","re":true},"ev",false,"/ev",{"VAR=":"BMK","re":true},{"->":".^.^.^.g-0"},null],"c-2":["^ ",{"->":"location_shrine_of_euryale"},"\n",{"->":".^.^.^.g-0"},null],"#n":"curtain_left_opts"}],{"g-0":[{"->":".^.^.curtain_left_opts"},null]}],null],"curtain_right":[["^This alcove is filled with the smoke of a burning pyre set against the far wall. Hundreds of everburning candles surround the pyre, the wax collecting into brass bowls etched with snaking patterns.","\n","#","^IMAGE: images/shape-cross.png","/#","^Drawing nearer to the pyre, you see that only ashes remain of whatever proud servant of the queen was immolated here. However, a stone slab set into the base of the pyre has been etched with the symbol of [red]three lines in the shape of a cross[/red].","\n",["ev","str","^Watch the ghosts","/str",{"VAR?":"ELX"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Put burial mask on","/str",{"VAR?":"BMK"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Go back out to the shrine","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^A phantom priestess clutching a holy symbol rests atop the pyre amid the flames.","\n","#","^IMAGE: images/shape-cross.png","/#","^A ghostly maiden stands above the burning priestess, her silent lips mouthing a petition to the goddess Euryale to rid the deceased’s heart of guilt and make them light enough to pass into paradise.","\n",{"->":".^.^.^.g-0"},null],"c-1":["^ ",{"->":"burial_mask_on"},"\n",{"->":".^.^.^.g-0"},null],"c-2":["^ ",{"->":"location_shrine_of_euryale"},"\n",{"->":".^.^.^.g-0"},null],"#n":"curtain_right_opts"}],{"g-0":[{"->":".^.^.curtain_right_opts"},null]}],null],"burial_mask_on":[["^You hold the burial mask over the roiling pyre flames, the brass glowing red hot. After hesitating for a moment, you thrust the mask onto your face.","\n","^Scorching heat and blinding pain shoots through your body. You shriek in agony, the sound muffled by the mask.","\n","^You try to throw the mask off your face, but it begins to melt and harden over your eyes, nose, and mouth.","\n","ev","str","^Use the healing potion","/str",{"VAR?":"PTN"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Try to throw off the mask","/str",{"VAR?":"PTN"},"!","/ev",{"*":".^.c-1","flg":5},{"c-0":["\n","#","^IMAGE: images/brass-71.jpg","/#","^In desperation you grab the healing potion from your belt and pour it over your face. Luckily, the magic liquid loosens and cools the searing mask.","\n","^You toss the misshapen chunk of brass into the corner of the shrine, knocking over several everburning candles in the process, and wipe the soot and tears from your swollen eyes.","\n","^>>- You no longer have the <b>healing potion</b>.","\n","ev",false,"/ev",{"VAR=":"PTN","re":true},["ev","str","^Return to the shrine","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"location_shrine_of_euryale"},"\n",null]}],null],"c-1":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^You try to throw the mask off your face, but it begins to melt and harden over your eyes, nose, and mouth.","\n","^You fall to the ground and lose consciousness, the molten mask on your face twisted into an eternally screaming visage.","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}],null],"location_throne_of_cinder":[["#","^AUDIOLOOP: music/kaldera.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/cinder-96.jpg","/#","^<h3>Throne of Cinder</h3>","\n","^The white fog gate dissipates, revealing an impossibly large cavern dotted with crumbling pillars, toppled statues, and the tattered banners of a benighted kingdom.","\n","^A low flight of broad steps leads up toward a throne of volcanic glass, its jagged outline silhouetted by the glowing of lava floes in the distance. A shadowy figure rises from the throne, casts off her cloak, and steps forward. A crown of coiled brass snakes is visible atop her head.","\n","ev","str","^Step forward","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["#","^IMAGE: images/kaldera-97.jpg","/#","^You step forward to face the shadowy figure. The churning of the lava floes becomes more violent, casting deep crimson shadows along the rows of columns and towering statues that surround you in this throne cavern.","\n","^“You’ve come for my crown, seeker,” the figure intones. When your eyes adjust to the gloom, you make out the unmistakable figure of Kaldera, her body little more than dripping shadows and clouds of ash beneath the sparkling crown.","\n","ev","str","^Brace yourself","/str","/ev",{"*":".^.c-1","flg":4},{"c-1":["\n",{"->":".^.^.^.g-1"},null]}],"g-1":["^Kaldera raises a cruel barbed spear that glows like a weapon just pulled from a forge. Arcing her lithe arms back, she prepares to cast her spear with the wrath of the ancient gods.","\n","^You dart your eyes around the unfamiliar cave in search of an advantage, but spy only a maze of pitch-dark passageways beyond the pillars, the red eyes of stalking undead peering out.","\n","ev","str","^Dodge into the pitch-dark passageways","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Stand resolute and take the hit","/str","/ev",{"*":".^.c-3","flg":4},{"c-2":["^ ",{"->":"throne_passageways"},"\n",null],"c-3":["^ ",{"->":"throne_hit"},"\n",null]}]}],null],"throne_passageways":[["^You duck into the labyrinth of pitch-dark side passages, hoping to lose the pursuing wraith queen and evade her fiery wrath.","\n","^The red eyes you spied from the throne surround you, growing more numerous with each labored breath you take. The sound of snapping jaws and flapping wings grows louder as the eyes draw closer.","\n","^You feel that you are surrounded here in the dark.","\n","ev","str","^Wait","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":".^.^.g-0"},null],"g-0":["ev",{"VAR?":"BFR"},"/ev",[{"->":".^.b","c":true},{"b":["^ Suddenly, bright flames like sunlight erupt from your eyes, frightening away the undead — you have been protected by the <b>blessing of fire</b>.",{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["^Suddenly, you are pinned by a swarm of undead, their teeth, claws, and wings slicing open your leather armor and digging into your flesh.",{"->":".^.^.^.5"},null]}],"nop","\n","ev","str","^Run","/str",{"VAR?":"BFR"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Run","/str",{"VAR?":"BFR"},"!","/ev",{"*":".^.c-2","flg":5},{"c-1":["\n","^Using the blessed light as a guide, you sprint through the maze of hallways and staircases until reaching a balcony directly above an enraged Kaldera.","\n","^Before she realizes your maneuver, you shove an armored statue from the balcony down upon her, crushing her incorporeal form in an avalanche of stone.","\n",["ev","str","^Claim the Coiled Crown","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"claim_the_crown"},"\n",null]}],null],"c-2":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^You flail in an attempt to drive away the horde.","\n","^Kaldera approaches you in your agony from the darkness, kneels down, and whispers to you:","\n","^“Oh, to have journeyed so far, only to fall so close to what you sought.”","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}]}],null],"throne_hit":[["^You lock eyes with Kaldera and stare her down. She snarls back at you, her throat roaring with a deep red like the stoked coals of a brazier.","\n","^With an otherworldly shriek, she hurls her fiery spear at you with supernatural speed, an arcing trail of embers lingering in the darkness behind it.","\n","ev",{"VAR?":"BIR"},"/ev",[{"->":".^.b","c":true},{"b":["^You expect to feel the sharp immobilizing pain of the spear tip, but instead the weapon is deflected as if your body had been encased in enchanted plate armor — you have been protected by the <b>blessing of iron</b>.",{"->":".^.^.^.9"},null]}],[{"->":".^.b"},{"b":["^The point of the spear plunges into your chest, the searing pain spreading through your body in an instant.",{"->":".^.^.^.9"},null]}],"nop","\n","ev","str","^Throw the spear","/str",{"VAR?":"BIR"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Fall to your knees","/str",{"VAR?":"BIR"},"!","/ev",{"*":".^.c-1","flg":5},{"c-0":["\n","#","^IMAGE: images/sparks-103.jpg","/#","^You pick up the spear and hurl it back at Kaldera. Despite her incorporeal form, the burning spear pierces her chest and she collapses in a heap near her ruined throne.","\n",["ev","str","^Claim the Coiled Crown","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"claim_the_crown"},"\n",null]}],null],"c-1":["\n","#","^AUDIOLOOP: music/death.mp3","/#","^You fall to your knees and watch as your cloak, leather armor, and flesh peel away like parchment thrown into a bonfire.","\n","^Kaldera approaches you in your agony, kneels down, and whispers to you:","\n","^“Oh, to have journeyed so far, only to fall so close to what you sought.”","\n","^>>! YOU DIED","\n",{"->":"endgame"},null]}],null],"claim_the_crown":[["#","^AUDIOLOOP: music/finale.mp3","/#","#","^CLEAR","/#","#","^IMAGE: images/soot-104.jpg","/#","^You approach Kaldera with your longsword at the ready. Drawing close, she reaches up at you with lanky arms in a feeble attempt to strike you. With a shout that reverberates through the entire Scorched Keep and the forest beyond, you plunge your blade into Kaldera’s inky undead form. She lets out a hoarse cry before her body runs like molten tar down the steps leading to her empty throne.","\n","^You kneel down and pull the [red]Coiled Crown[/red] from the puddle of boiling sludge, long strands of tar dripping from the tangle of brass snakes and polished gems and sticking to your hands. At long last, you have claimed what you have come for. <b>And now, there is one final decision you must make</b>.","\n","ev","str","^Leave this world","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Remain in this world","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"finale_1"},"\n",null],"c-1":["^ ",{"->":"finale_2"},"\n",null]}],null],"finale_1":["#","^CLEAR","/#","#","^IMAGE: images/leave-105.jpg","/#","^Coiled Crown in hand, you turn away from the seeping tar-like remains of Kaldera and march toward an enormous glowing door at the head of this sprawling cavern. Blinding light glows through the seams. You tighten your grip on the Crown and, in a triumphant voice, shout for the portal to open back to your own world.","\n","^You have no desire to rule, to enmesh yourself in the petty squabbles of heirs, of courtiers, of merchants. You have no taste for the raising of monuments or the waging of war. You simply desire to be left alone, to indulge in your own appetites; and with the gold you’ll fetch for the crown you’ve claimed, a life of luxurious solitude awaits you back in the mortal realm.","\n","^>>@ VICTORY ACHIEVED","\n","end",null],"finale_2":["#","^CLEAR","/#","#","^IMAGE: images/stay-106.jpg","/#","^Coiled Crown in hand, you turn away from the seeping tar-like remains of Kaldera and march toward the throne of volcanic glass that sits at the head of this sprawling cavern. You let out an exhausted sigh and drop onto the throne. Looking around, you see in the gloom statues of a regal woman, a fierce but fair ruler to her people that adored her so. Never in your past life did you command such attention, such respect, such love.","\n","^With trembling fingers you place the mythic crown atop your head. Strangely, it is a perfect fit, as if fate had brought you to this throne, as if you were destined to breathe fire back into this dark world and raise its faithful people to glory once more.","\n","^>>@ VICTORY ACHIEVED","\n","end",null],"global decl":["ev",false,{"VAR=":"BMP"},false,{"VAR=":"BMK"},false,{"VAR=":"PTN"},false,{"VAR=":"HMD"},false,{"VAR=":"WFG"},false,{"VAR=":"FLB"},false,{"VAR=":"FLW"},false,{"VAR=":"EBC"},true,{"VAR=":"EPV"},false,{"VAR=":"BIR"},false,{"VAR=":"BFR"},false,{"VAR=":"RVK"},false,{"VAR=":"ELX"},false,{"VAR=":"SNK"},false,{"VAR=":"tarot_death"},"/ev","end",null]}],"listDefs":{}}